
#приветствие
puts 'Привет, мир!'
#пустая строка, надеюсь не буду больше путать ее с nil
puts ''

#складываю строки
puts "Я люблю ruby" + "и уверена, что у меня получится его выучить"
#добавим пробел, можно к любой из фраз
puts "Я люблю ruby " + "и уверена, что у меня получится его выучить"
puts "Я люблю ruby" + " и уверена, что у меня получится его выучить"

#умножим на 5, фраза повторится 5 раз
puts "ля" * 5

#складываем числа
puts  12  +  12
#складываем строки с числами
puts '12' + '12'
#выводим фразу с арифметическим выражением
puts '12  +  12'

#нельзя умножать строку на строку, прибавлять строку к числу и умножать число на строку (строку на число можно)
#puts 'Бетти' + 12
#puts 'Фред' * 'Джон'
#puts 5 * "ruby"

#чтобы кавычки отображались в строке при выводе, нужно добавить обратную черту (символ экранирования), экранирует сам себя \\ = \, \" = "
puts '\'Ты шикарная!\''




